In [47]:
import requests
import pandas as pd
import datetime

# الفترات الزمنية من الرابط
period1 = 31813200       # تقريبًا من: 1970 أو بعده
period2 = 1746648722     # تقريبًا إلى: نهاية 2025

# رمز مؤشر الدولار الأمريكي في Yahoo Finance
symbol = "DX-Y.NYB"

# رابط API المباشر
url = f"https://query1.finance.yahoo.com/v8/finance/chart/{symbol}?period1={period1}&period2={period2}&interval=1d"

headers = {
    "User-Agent": "Mozilla/5.0"
}

# إرسال الطلب
r = requests.get(url, headers=headers)
data = r.json()

# استخراج البيانات
timestamps = data['chart']['result'][0]['timestamp']
indicators = data['chart']['result'][0]['indicators']['quote'][0]

# تحويل التواريخ مع التعامل مع التواريخ القديمة
dates = []
for ts in timestamps:
    try:
        # محاولة تحويل الـ timestamp إلى تاريخ
        dates.append(datetime.datetime.utcfromtimestamp(ts).date())  # استخدام utcfromtimestamp
    except Exception as e:
        # إذا فشل التحويل، ضيف قيمة فارغة ولكن لا تستخدم None في حالة التواريخ القديمة
        dates.append("Invalid Date")  # تعبير عن تواريخ غير صحيحة، أو قديمة جدًا

# إنشاء DataFrame
df = pd.DataFrame(indicators)
df['Date'] = dates

# ترتيب الأعمدة
df = df[['Date', 'open', 'high', 'low', 'close', 'volume']]

In [48]:
df.head()

         Date        open        high         low       close  volume
0  1971-01-04  120.529999  120.529999  120.529999  120.529999     0.0
1  1971-01-05  120.519997  120.519997  120.519997  120.519997     0.0
2  1971-01-06  120.489998  120.489998  120.489998  120.489998     0.0
3  1971-01-07  120.550003  120.550003  120.550003  120.550003     0.0
4  1971-01-08  120.529999  120.529999  120.529999  120.529999     0.0

In [49]:
df.isnull().sum()

Date         0
open      3045
high      3045
low       3045
close     3045
volume    3045
dtype: int64

In [50]:
df = df.dropna(axis = 0)

In [51]:
df.head()

         Date        open        high         low       close  volume
0  1971-01-04  120.529999  120.529999  120.529999  120.529999     0.0
1  1971-01-05  120.519997  120.519997  120.519997  120.519997     0.0
2  1971-01-06  120.489998  120.489998  120.489998  120.489998     0.0
3  1971-01-07  120.550003  120.550003  120.550003  120.550003     0.0
4  1971-01-08  120.529999  120.529999  120.529999  120.529999     0.0

In [52]:
df.tail()

             Date        open        high        low       close  volume
16841  2025-05-01   99.650002  100.379997  99.610001  100.250000     0.0
16842  2025-05-02  100.180000  100.330002  99.400002  100.000000     0.0
16844  2025-05-05  100.000000  100.050003  99.459999   99.830002     0.0
16845  2025-05-06   99.830002  100.099998  99.169998   99.239998     0.0
16846  2025-05-07   99.503998   99.897003  99.286003   99.896004     0.0

In [53]:
df.shape

(13802, 6)

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 13802 entries, 0 to 16846
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    13802 non-null  object
 1   open    13802 non-null  float64
 2   high    13802 non-null  float64
 3   low     13802 non-null  float64
 4   close   13802 non-null  float64
 5   volume  13802 non-null  float64
dtypes: float64(5), object(1)
memory usage: 754.8+ KB

In [55]:
df.to_csv('full_Dollar.csv', index = False)